; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 815663 1 2 4 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared1 - mode
	spectrograph0 - mode
	infrared2 - mode
	image3 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star3 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 infrared2)
	(have_image Planet10 image3)
	(have_image Planet11 image3)
	(have_image Star12 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star8 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 star8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
6. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 1 of 6
7. (turn_to satellite0 star5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
8. (turn_to satellite0 star12 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star12)
   goals met: 1 of 6
9. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 2 of 6
10. (turn_to satellite0 star5 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star5)
   goals met: 3 of 6
11. (turn_to satellite0 planet11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet11)
   goals met: 2 of 6
12. (take_image satellite0 planet11 instrument0 image3)
   added: (have_image planet11 image3)
   goals met: 3 of 6
13. (turn_to satellite0 star5 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star5)
   goals met: 4 of 6
14. (turn_to satellite0 planet10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet10)
   goals met: 3 of 6
15. (take_image satellite0 planet10 instrument0 image3)
   added: (have_image planet10 image3)
   goals met: 4 of 6
16. (turn_to satellite0 star5 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star5)
   goals met: 5 of 6
17. (turn_to satellite0 phenomenon9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 6
18. (take_image satellite0 phenomenon9 instrument0 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 5 of 6
19. (turn_to satellite0 star5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star5)
   goals met: 6 of 6
